{
  "projects": [
    {
      "title": "TastyTrek",
      "shortDescription": "A full-stack food delivery web application with real-time order tracking, user/admin panels, and secure payments.",
      "longDescription": "TastyTrek is a complete food delivery platform built using Spring Boot and React. It features user and admin dashboards, JWT-based authentication, and real-time order tracking. The app integrates Razorpay for secure online payments and stores images using AWS S3. Backend APIs are optimized for performance with MongoDB Atlas, and the backend is containerized using Docker for seamless deployment on Render.",
      "skills": ["Spring Boot", "React", "MongoDB Atlas", "Docker", "JWT", "Razorpay", "AWS S3", "Bootstrap"],
      "video": "https://www.youtube.com/embed/QnkhEgia3SM",
      "liveDemoLink": "https://tastytrekjanisar.netlify.app",
      "sourceCodeLink": "https://github.com/janisar392/TastyTrekApp"
    },
    {
      "title": "My AI Neighbor",
      "shortDescription": "A full-stack AI image generator that transforms photos and text into Studio Ghibli-style art using Stability AI.",
      "longDescription": "My AI Neighbor is a creative full-stack AI application that allows users to generate Studio Ghibli-style anime artwork from uploaded photos or text prompts. Built using React and Spring Boot, it offers two core modes: 'Photo to Art' and 'Text to Art'. The app features real-time image rendering, prompt enhancement, and a sleek UI with Tailwind CSS and Shadcn UI. Backend is powered by Spring Boot and Feign clients, deployed seamlessly on Render with frontend hosted via Netlify.",
      "skills": ["React", "Tailwind CSS", "Shadcn UI", "Spring Boot", "Feign", "Netlify", "Render", "Stability AI"],
      "video": "https://www.youtube.com/embed/lZbe_5LlKtU",
      "liveDemoLink": "https://myaineighborjanisar.netlify.app",
      "sourceCodeLink": "https://github.com/janisar392/MyAINeighbor"
    },
    {
      "title": "AI Resume Builder",
      "shortDescription": "An intelligent resume builder powered by local LLMs, offering personalized suggestions using prompt engineering.",
      "longDescription": "AI Resume Builder is an AI-driven application that helps users create personalized and impactful resumes by leveraging local LLMs like DeepSeek through Ollama. The backend is powered by Spring Boot and Spring AI, using prompt engineering to tailor resume content in real time. The user interface is clean and minimal, built with HTML, CSS, and vanilla JavaScript. The app supports smart formatting and quick editing, helping users craft professional resumes with minimal effort.",
      "skills": ["Spring Boot", "Spring AI", "DeepSeek", "Ollama", "Prompt Engineering", "HTML", "CSS", "JavaScript"],
      "video": "https://www.youtube.com/embed/04OMCtM4tEU",
      "liveDemoLink": "#",
      "sourceCodeLink": "https://github.com/janisar392/AI-Resume-Builder"
    }
  ]
}
